Repository: Bayrakovsky/KeenSwitch
Catalog: KeenSwitch/Localizable.xcstrings
Source language: en
Languages: ru

# Active Policy Hint
source: Currently active policy
ru: Текущая активная политика

# Allow Login Items
source: Allow KeenSwitch in System Settings → Login Items.
ru: Разрешите KeenSwitch в «Системные настройки → Объекты входа».

# App Settings Window Title
source: KeenSwitch Settings
ru: Настройки KeenSwitch

# Applying Policy
source: Applying “%@”…
ru: Применение «%@»…

# Auto Check Footer
source: KeenSwitch will check for updates at launch.
ru: KeenSwitch будет проверять обновления при запуске.

# Auto Check For Updates
source: Automatically check for updates
ru: Автоматически проверять обновления

# Built-in Default Policy
source: Default policy
ru: Политика по умолчанию

# Built-in Default Segment Policy
source: Default segment policy
ru: Политика по умолчанию сегмента

# Built-in No Internet
source: No internet access
ru: Без доступа в интернет

source: Check
ru: Проверить

source: Check for Updates
ru: Проверить обновления

source: Checking for updates…
ru: Проверка обновлений…

# Configure Router First
source: Configure router connection first
ru: Сначала настройте подключение к роутеру

source: Connected
ru: Подключено

source: Connecting
ru: Подключение

source: Connecting…
ru: Подключение…

source: Connection
ru: Подключение

# Connection Timeout
source: Timeout: %@. Check the router address in settings.
ru: Таймаут: %@. Проверьте адрес роутера в настройках.

source: Default segment policy
ru: Политика по умолчанию сегмента

source: Device
ru: Устройство

# Device Count Few
source: devices
ru: устройства

# Device Count Many
source: devices
ru: устройств

# Device Count One
source: device
ru: устройство

source: Devices
ru: Устройства

source: Disconnected
ru: Отключено

# Download Update
source: Download
ru: Скачать

source: Downloading update…
ru: Загрузка обновления…

# Empty Router Response
source: Empty response from router
ru: Пустой ответ роутера

# Enter Password
source: Enter a password
ru: Укажите пароль

source: Error
ru: Ошибка

# Failed To Assign Policy
source: Could not assign policy “%@”
ru: Не удалось назначить политику «%@»

# Failed To Read Version Data
source: Could not read router data (show version)
ru: Не удалось прочитать данные роутера (show version)

# Fill Connection Settings
source: Fill in connection settings
ru: Заполните настройки подключения

# Generic Error With Code
source: Operation failed (code %d).
ru: Операция не выполнена (код %d).

source: GitHub Token
ru: GitHub токен

# GitHub Token Footer
source: Only needed for private repositories. For public repos leave this empty.
ru: Нужен только пока репозиторий приватный. После публикации оставьте поле пустым.

# Host Not Found
source: Host %@ not found. Check the router address in settings.
ru: Хост %@ не найден. Проверьте адрес роутера в настройках.

# HTTPS Toggle Disabled Help
source: With a custom port, change HTTP/HTTPS by editing the port or set it to 80 or 443.
ru: При нестандартном порте переключите протокол через порт или укажите 80 / 443.

source: Install Update
ru: Установить

source: Installing update…
ru: Установка обновления…

source: Interface language
ru: Язык интерфейса

# Interface Language Footer
source: Applies immediately. “Automatic” follows the system language.
ru: Применяется сразу. «Автоматически» — язык системы.

# Invalid Credentials
source: Invalid username or password
ru: Неверное имя пользователя или пароль

source: Invalid router address
ru: Некорректный адрес роутера

# Invalid Signature
source: Downloaded app has invalid code signature
ru: Загруженное приложение имеет недействительную подпись

source: Keenetic router
ru: Роутер Keenetic

source: KeenSwitch will launch at login
ru: KeenSwitch запустится при входе в систему

# Keychain Error
source: Keychain error (%lld)
ru: Ошибка Keychain (%lld)

source: Language
ru: Язык

# Language Automatic
source: Automatic
ru: Автоматически

# Language Russian
source: Russian
ru: Русский

source: Launch
ru: Запуск

# Launch At Login Failed
source: Could not configure launch at login: %@
ru: Не удалось настроить автозапуск: %@

# Loading Router Data
source: Loading data from router…
ru: Загрузка данных с роутера…

# Mismatch On Router
source: On router: %@. Expected: “%@”
ru: На роутере: %@. Ожидалось: «%@»

# Network Error With Code
source: Network error (code %d) while connecting to %@.
ru: Сетевая ошибка (код %d) при подключении к %@.

source: Network interface
ru: Интерфейс

# No Connection To Host
source: Cannot reach %@. Make sure the IP and port match the web UI.
ru: Нет связи с %@. Убедитесь, что IP и порт совпадают с веб-интерфейсом.

source: No devices
ru: Нет устройств

# No Download Asset
source: No .zip asset found in this release
ru: В этом релизе нет .zip файла

# No Internet Connection
source: No network connection.
ru: Нет подключения к сети.

source: Not connected
ru: Не подключено

source: Offline
ru: Не в сети

source: Online
ru: В сети

source: Open
ru: Открыть

source: Open at login
ru: Открывать при входе

source: Operation cancelled.
ru: Операция отменена.

source: Others
ru: Остальные

source: Password
ru: Пароль

source: Pin
ru: Закрепить

source: Pinned
ru: Закреплённые

# Pinned Help
source: Pinned devices appear at the top of the list
ru: Закреплённые устройства отображаются в начале списка

# Policies Not Found In RCI
source: No policies found in RCI response. Open Console.app, filter “RCI”, and share the log after Refresh.
ru: Политики не найдены в ответе RCI. Откройте Console.app → фильтр «RCI» и пришлите фрагмент лога после «Обновить».

source: Policies not loaded
ru: Политики не загружены

# Policy Count Few
source: policies
ru: политики

# Policy Count Many
source: policies
ru: политик

# Policy Count One
source: policy
ru: политика

source: Port
ru: Порт

source: Quiet launch at login
ru: Тихий запуск при входе

# Quiet Launch Footer
source: When enabled, only the menu bar icon is shown after login.
ru: При включении после входа показывается только иконка в строке меню.

source: Quit KeenSwitch
ru: Завершить KeenSwitch

source: Refresh
ru: Обновить

# Refresh Hint
source: Connect to the router and tap Refresh
ru: Подключитесь к роутеру и нажмите «Обновить»

# Refreshed Summary
source: Updated: %lld %@, %lld %@
ru: Обновлено: %lld %@, %lld %@

source: Request error
ru: Ошибка запроса

# Restart Shortly
source: The app will restart shortly.
ru: Приложение перезапустится автоматически.

source: Router address
ru: Адрес роутера

# Router Info Footer
source: Credentials are stored in the Keychain. Data is loaded via HTTP RCI.
ru: Учётные данные хранятся в Keychain. Данные загружаются по HTTP RCI.

# Router Updated
source: Router settings updated
ru: Настройки на роутере обновлены

source: Routing
ru: Маршрутизация

source: Save configuration after change
ru: Сохранять конфигурацию после изменения

# Save Configuration Footer
source: Writes running config to flash on the router (system configuration save).
ru: Записывает текущую конфигурацию во flash роутера (system configuration save).

# Select Device
source: Select a device
ru: Выберите устройство

# Select Device Above
source: Select a device above
ru: Выберите устройство выше

source: Select Policy
ru: Выбрать политику

source: Settings
ru: Настройки

source: Testing connection…
ru: Проверка подключения…

# TLS Error
source: TLS error while connecting to %@. Try turning HTTPS off or check the router's certificate.
ru: Ошибка TLS при подключении к %@. Попробуйте отключить HTTPS или проверьте сертификат роутера.

# Unexpected Auth Response
source: Unexpected response from /auth
ru: Неожиданный ответ /auth

# Unknown Policy Mode
source: Unknown mode “%@”
ru: Неизвестный режим «%@»

source: Unpin
ru: Открепить

# Unzip Failed
source: Failed to unzip archive
ru: Не удалось распаковать архив

# Up To Date
source: You're up to date
ru: У вас актуальная версия

source: Update available
ru: Доступно обновление

# Update Check Failed
source: Could not check for updates
ru: Не удалось проверить обновления

source: Updates
ru: Обновления

source: User
ru: Пользователь

source: Version
ru: Версия
